const text = {

  en:{
    title:"🏪 Nearby Markets",
    desc:"Turn on location to find nearest markets",
    btn:"📍 Use My Location",
    add_place:"➕ Add My Place",
    placeholder:"Enter your market / place name",
    distance:"Distance",
    time:"Estimated Time"
  },

  ml:{
    title:"🏪 സമീപമുള്ള മാർക്കറ്റുകൾ",
    desc:"സമീപ മാർക്കറ്റുകൾ കണ്ടെത്താൻ ലൊക്കേഷൻ ഓൺ ചെയ്യുക",
    btn:"📍 എന്റെ ലൊക്കേഷൻ ഉപയോഗിക്കുക",
    add_place:"➕ എന്റെ സ്ഥലം ചേർക്കുക",
    placeholder:"നിങ്ങളുടെ മാർക്കറ്റ് / സ്ഥലത്തിന്റെ പേര് നൽകുക",
    distance:"ദൂരം",
    time:"ഏകദേശം സമയം"
  },

  ta:{
    title:"🏪 அருகிலுள்ள சந்தைகள்",
    desc:"அருகிலுள்ள சந்தைகளை கண்டறிய இடத்தை இயக்கவும்",
    btn:"📍 என் இருப்பிடத்தை பயன்படுத்தவும்",
    add_place:"➕ என் இடத்தை சேர்க்க",
    placeholder:"உங்கள் சந்தை / இடத்தின் பெயரை உள்ளிடவும்",
    distance:"தூரம்",
    time:"மதிப்பிடப்பட்ட நேரம்"
  },

  te:{
    title:"🏪 సమీప మార్కెట్లు",
    desc:"సమీప మార్కెట్లు తెలుసుకోవడానికి లొకేషన్ ఆన్ చేయండి",
    btn:"📍 నా లొకేషన్ ఉపయోగించండి",
    add_place:"➕ నా స్థలం జోడించు",
    placeholder:"మీ మార్కెట్ / ప్రదేశం పేరు నమోదు చేయండి",
    distance:"దూరం",
    time:"అంచనా సమయం"
  },

  kn:{
    title:"🏪 ಹತ್ತಿರದ ಮಾರುಕಟ್ಟೆಗಳು",
    desc:"ಹತ್ತಿರದ ಮಾರುಕಟ್ಟೆಗಳನ್ನು ಹುಡುಕಲು ಸ್ಥಳವನ್ನು ಆನ್ ಮಾಡಿ",
    btn:"📍 ನನ್ನ ಸ್ಥಳ ಬಳಸಿ",
    add_place:"➕ ನನ್ನ ಸ್ಥಳ ಸೇರಿಸಿ",
    placeholder:"ನಿಮ್ಮ ಮಾರುಕಟ್ಟೆ / ಸ್ಥಳದ ಹೆಸರನ್ನು ನಮೂದಿಸಿ",
    distance:"ದೂರ",
    time:"ಅಂದಾಜು ಸಮಯ"
  },

  hi:{
    title:"🏪 नज़दीकी बाज़ार",
    desc:"नज़दीकी बाज़ार जानने के लिए लोकेशन चालू करें",
    btn:"📍 मेरी लोकेशन उपयोग करें",
    add_place:"➕ मेरा स्थान जोड़ें",
    placeholder:"अपना बाज़ार / स्थान नाम दर्ज करें",
    distance:"दूरी",
    time:"अनुमानित समय"
  }
};